# GetAddInNameFromDocument Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInId..::..GetAddInNameFromDocument Method
AddInId Class See Also
---
name of application associated with this ApplicationId First attempts to obtain the name from AddInIds stored in the document. If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string GetAddInNameFromDocument(
	Document aDoc
)
```

Visual Basic
---
```text
Public Function GetAddInNameFromDocument ( _
	aDoc As Document _
) As String
```

Visual C++
---
```text
public:
String^ GetAddInNameFromDocument(
	Document^ aDoc
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document target document
# ### Return Value
name of application
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was NULL |

# See Also
AddInId Class
Autodesk.Revit.DB Namespace